---
kind: type
id: T:Autodesk.Revit.DB.DetailLine
source: html/5e6ee932-6034-e414-f7e2-3550c805d904.htm
---
# Autodesk.Revit.DB.DetailLine

Represents a DetailLine within Autodesk Revit.

## Syntax (C#)
```csharp
public class DetailLine : DetailCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
DetailCurve::geometryCurve property.